RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S28/LPC55S28/drivers/fsl_i2s_dma.c
    if ((!transferDone) || (i2sHandle->state == (uint32_t)kI2S_DmaStateIdle))
    {
        return;
    }

    if (privateHandle->dmaDescriptorsUsed > 0U)
    {
        /* Finished descriptor, decrease amount of data to be processed */

        i2sHandle->i2sQueue[queueDriverIndex].dataSize -= enqueueBytes;
        i2sHandle->i2sQueue[queueDriverIndex].data                      = (uint8_t *)(queueDataAddr + enqueueBytes);
        privateHandle->enqueuedBytes[privateHandle->enqueuedBytesStart] = 0U;
        privateHandle->enqueuedBytesStart = (privateHandle->enqueuedBytesStart + 1U) % DMA_DESCRIPTORS;
        privateHandle->dmaDescriptorsUsed--;
    }

    if (i2sHandle->i2sQueue[queueDriverIndex].dataSize == 0U)
    {
        /* Entire user buffer sent or received - advance to next one */
        i2sHandle->i2sQueue[queueDriverIndex].data = NULL;
        i2sHandle->queueDriver                     = (queueDriverIndex + 1U) % I2S_NUM_BUFFERS;
        /* Notify user about buffer completion */
        if (i2sHandle->completionCallback != NULL)
        {
            (i2sHandle->completionCallback)(base, i2sHandle, kStatus_I2S_BufferComplete, i2sHandle->userData);
        }
    }

    if (i2sHandle->state != (uint32_t)kI2S_DmaStateBusyLoopTransfer)
    {
        /* check next buffer queue is avaliable or not */
        if (i2sHandle->i2sQueue[i2sHandle->queueDriver].dataSize == 0U)
        {
            if (i2sHandle->state == (uint32_t)kI2S_DmaStateTx)
            {
                (void)I2S_EmptyTxFifo(base);
            }
            /* All user buffers processed */
            I2S_TransferAbortDMA(base, i2sHandle);
        }
        else
        {
            /* Enqueue another user buffer to DMA if it could not be done when in I2S_Rx/TxTransferSendDMA */
            I2S_AddTransferDMA(base, i2sHandle);
        }
    }
}
